<div class="page">

	<h1>Тестовое задание:</h1>
	<p>
		Есть таблица пользователей с произвольной структурой. Необходимо реализовать перевод условной единицы (баллов, попугаев, биткоинов и тд) от одного пользователя к другому. При каждом переводе нужно сохранять лог операций. Для каждого пользователя вывести баланс. Учитывать целостность данных.
	</p>
	<h2>Требования:</h2>
	<p>
	1. Использовать PHP 7+<br>
	2. ООП<br>
	3. Разрешается использование фреймворков<br>
	Загрузить решение и инструкцию для деплоя проекта в репозиторий на github<br>
	</p>

</div><!-- /page -->